// 큐브 트립 메인 JS - main.js //

/// 로드구역 : html태그를 모두 그린 후 실행구역 /////
/// load이벤트는 img, video 등의 모든 컨텐츠 로딩후 실행함(시간걸림)
/// DOMContentLoaded 이벤트는 html태그만 그리면 바로실행(시간단축)
window.addEventListener("DOMContentLoaded",function(){
    
    // 1. 로드구역 확인
    console.log("로딩완료!");
    
    
    
});///////// 로드구역 //////////////////////////////////
//////////////////////////////////////////////////////

/*///////////////////////////////////////////
    함수명:chgCity
    기능:메뉴 클릭시 도시명에 맞게 큐브를 회전시키고 
         설명이 나오게함
*////////////////////////////////////////////
function chgCity(me){ // me - 클릭된 요소 자신
    // 1.함수호출확인, 전달값 확인
    console.log("나야나!"+me.innerText);
}//////// chgCity 함수 ////////////////////////
////////////////////////////////////////////








