//// 쇼핑몰 JS - main.js /////

///// 로드구역 //////////////////////////////
window.addEventListener("DOMContentLoaded",
    function () {
        console.log("로딩완료!");

        // 이동버튼 클릭시 슬라이드 넘기기 /////
        // 클릭 이벤트 대상: .abtn

        // 이동버튼
        var btn = document.querySelectorAll('.abtn');
        console.log("버튼개수:" + btn.length);

        // 왼쪽버튼
        btn[0].onclick = function () {
            console.log("왼쪽이양!");
            
            //이동함수 호출
            goSlide(0);
            
            // a태그 기본이동 막기!
            return false;
            
        }; ///// click /////////////////////

        // 오른쪽버튼
        btn[1].onclick = function () {
            console.log("오른쪽이양!");
            
            //이동함수 호출
            goSlide(1);
            
            // a태그 기본이동 막기!
            return false;
            
        }; ////// click ////////////////////


        /*////////////////////////////////////////////
            함수명: goSlide
            기능: 슬라이드가 넘어가도록 기능구현함
        */ ////////////////////////////////////////////
        var goSlide = function (dir) {
            
            console.log("방향구분:"+dir);
            
        };////// goSlide함수 ///////////////////////////
        ///////////////////////////////////////////////
    
    

        /*////////////////////////////////////////////
            함수명: autoSlide
            기능: 자동넘기기 셋팅함수(인터발함수)
        */ ////////////////////////////////////////////
        var autoSlide = function () {};

        /*////////////////////////////////////////////
            함수명: clearAuto
            기능: 자동넘김 지우기함수(클리어인터발함수)
        */ ////////////////////////////////////////////
        var clearAuto = function () {};


    }); /////////////// 로드구역 ///////////////////////
///////////////////////////////////////////////////////
///////////////////////////////////////////////////////
